{"pageProps":{"post":{"slug":"up24_notifications","title":"UpNotifications for Jawbone UP24","description":"Jawbone up24 call notifications","date":"2015-03-21T00:00:00.322Z","content":"<h1>UpNotifications for Jawbone UP24</h1>\n<p><strong>UPDATE</strong>: Google has changed a how the app should ask for the <code>READ_SMS, RECEIVE_SMS</code> permissions. Unfortunately I’ve not been able to update UpNotifications and this resulted in the app being removed from the Play Store.\nI’m leaving here a link to the APK for anyone who’s interested in trying out the app. Just keep in mind that I won’t be able to provide any support.</p>\n<p><a href=\"https://www.dropbox.com/s/9jkqaxjod6ilmkn/upnotifications.apk?dl=0\">UpNotifications APK Download</a></p>\n<h3>Intro</h3>\n<p>After my last blog post on <a href=\"../up24_reverse_engineering\">UP24 Reverse engineering</a> I received a lot emails about the Android application I wanted to write for myself to receive notifications on the jawbone up24 band.</p>\n<p>During the last month I found the time to write such app and release a <a href=\"https://www.youtube.com/watch?v=JFcVZpmnbII\">demostration video</a> of how it works.</p>\n<h3>First release</h3>\n<p>Time has come to make this application publicly available, <del>and here you can have it for just a small fee that will allow me to keep the app up-to-date:\n<a href=\"https://play.google.com/store/apps/details?id=me.brilli.stefano.upnotifications\" target=\"_blank\">Download UpNotifications for UP24</a>.</del></p>\n<h3>Requirements</h3>\n<ul>\n<li>Official UP Application</li>\n<li>An UP24 band paired with your device</li>\n<li>Firmware version 3.0.21 running on your band</li>\n</ul>\n<h3>Disclaimer</h3>\n<p>This application has been widely tested and it is proven to work correctly; actually the author itself use this app on a daily basis to get calls and sms notifications on its wrist.</p>\n<p>However it is important to state that this application is the result of a reverse engineering process, hence:</p>\n<ul>\n<li>It may interfere with normal functioning of the band</li>\n<li>It may drain your band battery</li>\n<li>It may stop working anytime (especially after band’s software update)</li>\n<li>It may not work with all band versions</li>\n</ul>\n<h3>Privacy Policy</h3>\n<p>Read here the <a href=\"/upnotifications_privacy\">UpNotifications privacy policy</a></p>\n<h3>Legal Notice</h3>\n<p>This product is not affiliated with, nor endorsed or licensed in any way by Jawbone.\nJawbone, UP, and UP24 are trademarks or registered trademarks of Jawbone corporation. All rights reserved.</p>\n<p><em>— 21/03/2015</em></p>"}},"__N_SSG":true}